#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.archive_file.lambda_function: Refreshing state... [id=966380112fc320910fd80bf456aff3d9a512764d]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_lambda_function.lambda_function: Refreshing state... [id=lapwing-item-news-dev-lambda]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main.aws_iam_policy.scheduler_policy will be created
  + resource "aws_iam_policy" "scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-scheduler-role"
    }

  # module.main.aws_lambda_function.lambda_function is tainted, so must be replaced
-/+ resource "aws_lambda_function" "lambda_function" {
      ~ arn                            = "arn:aws:lambda:ap-northeast-1:087164360110:function:lapwing-item-news-dev-lambda" -> (known after apply)
      ~ code_sha256                    = "+8/Y2FWe5Ijc9tQBE/oWl8EcU8Kfm7ZUD7Adw4EJSvM=" -> (known after apply)
      ~ id                             = "lapwing-item-news-dev-lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:087164360110:function:lapwing-item-news-dev-lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2025-10-03T23:35:25.574+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:087164360110:function:lapwing-item-news-dev-lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:087164360110:function:lapwing-item-news-dev-lambda:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 334823 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/lapwing-item-news-dev-lambda" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be created
  + resource "aws_scheduler_schedule" "invoke_lambda" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "lapwing-item-news-dev-scheduler-group"
      + id                           = (known after apply)
      + name                         = "lapwing-item-news-dev-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0/10 * * * ? *)"
      + schedule_expression_timezone = "Asia/Tokyo"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-scheduler-role"

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 0
            }
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment the following text.
```
/deploy 18236318502
```